tsung/http-tsung.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='200000'></client>
  </clients>

  <!-- Server side setup -->
  <servers>
    <server host="***.cloudapp.net" port="80" type="tcp"></server>
  </servers>

  <load>
    <arrivalphase phase="1" duration="2" unit="minute">
      <users interarrival="2" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="2" duration="120" unit="minute">
      <users arrivalrate="10000" unit="second" ></users>
    </arrivalphase>
  </load>

  <options>
    <option type="ts_http" name="user_agent">
      <user_agent probability="80">Mozilla/5.0 (X11; U; Linux i686; en-US; rv:1.7.8) Gecko/20050513 Galeon/1.3.21</user_agent>
      <user_agent probability="20">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <sessions>
    <session name="http-example" probability="0" type="ts_http">
      <for from="1" to="10" incr="1" var="counter">
        <request> <http url="/?id=%%_counter%%" method="GET" version="1.1"></http> </request>
        <request> <http url="/foo?id=%%_counter%%" method="GET" version="1.1" ></http> </request>
        <request> <http url="/bar?id=%%_counter%%" method="GET" version="1.1" ></http> </request>
        <request> <http url="/boo/foo/woo?id=%%_counter%%" method="GET" version="1.1" ></http> </request>
      </for>
    </session>

    <session name="http-html" probability="100" type="ts_http">
      <for from="1" to="20" incr="1" var="counter">
        <request> <http url="/index.html?id=%%_counter%%" method="GET" version="1.1"></http> </request>
        <request> <http url="/test.html?id=%%_counter%%" method="GET" version="1.1"></http> </request>
      </for>
    </session>
  </sessions>
</tsung>